
brew 'git'
brew 'httpie'
brew 'jq'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'zsh'
# brew 'zsh-completions'
brew 'fzf'
brew 'ack'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'tmuxinator'
brew 'macvim'
brew 'htop'

cask_args appdir: "/Applications"

cask 'spotify'
cask 'visual-studio-code'
cask 'karabiner-elements'
cask 'google-chrome'
cask 'firefox'

cask 'iterm2'
cask 'alfred'

# QuickLook Plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzip'

# Useful Apps
cask 'caffeine'
cask 'docker'
cask '1password'
cask 'postman'
cask 'slack'

cask 'rectangle'
# cask 'divvy'

tap 'homebrew/cask-fonts'

cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-fira-code'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-firacode-nerd-font-mono'
cask 'font-firacode-nerd-font'
cask 'font-firamono-nerd-font-mono'
cask 'font-firamono-nerd-font'
