
brew 'git'
brew 'httpie'
brew 'jq'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'zsh'
# brew 'zsh-completions'
brew 'fzf'
brew 'ack'
brew 'the_silver_searcher'
# brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'tmuxinator'
brew 'macvim'
brew 'htop'
brew 'asdf'

brew 'coreutils'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'unzip'
brew 'curl'
brew 'gpg'

brew 'git-crypt'

brew 'openvpn'
brew 'zbar'
brew 'oath-toolkit'

brew 'kubernetes-cli'
brew 'minikube'

tap 'mongodb/brew'
brew 'mongodb-community'

brew 'watchman'

cask_args appdir: "/Applications"

cask 'spotify'
cask 'visual-studio-code'
cask 'karabiner-elements'
cask 'google-chrome'
cask 'firefox'

cask 'android-studio'
cask 'adoptopenjdk/openjdk/adoptopenjdk8'
cask 'https://raw.githubusercontent.com/caskroom/homebrew-cask/b6ac3795c1df9f97242481c0817b1165e3e6306a/Casks/react-native-debugger.rb'
# cask 'react-native-debugger'

cask 'iterm2'
cask 'alfred'

# QuickLook Plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzip'

# Useful Apps
cask 'caffeine'
cask 'docker'
cask '1password'
cask 'postman'
cask 'slack'

cask 'rectangle'
# cask 'divvy'

tap 'homebrew/cask-fonts'

cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-fira-code'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-firacode-nerd-font-mono'
cask 'font-firacode-nerd-font'
cask 'font-firamono-nerd-font-mono'
cask 'font-firamono-nerd-font'
